recebimento-facil/app/Clients/wsdl/PaymentRefCreateRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:pay="http://www.bancoeconomico.ao/xsd/paymentref">
  <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsdxmlns:wsu=http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken wsu:Id="soaAuth">
        <wsse:Username>K001</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText>pwd123456789"></wsse:Password>
        <wsu:Created>${=new java.text.SimpleDateFormat("yyyy-MM-dd'T'HH:mm:ss").format(new java.util.Date())}</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <pay:PaymentRefCreateRequest>
      <pay:HEADER>
        <pay:SOURCE>K001</pay:SOURCE>
        <pay:MSGID>${= java.util.UUID.randomUUID()}</pay:MSGID>
        <pay:USERID>KCR001</pay:USERID>
        <pay:BRANCH>000</pay:BRANCH>
        <!--Optional:-->
        <pay:PASSWORD/>
        <pay:INVOKETIMESTAMP>${=new java.text.SimpleDateFormat("yyyy-MM-dd'T'HH:mm:ss").format(new java.util.Date())}</pay:INVOKETIMESTAMP>
      </pay:HEADER>
      <pay:BODY>
        <pay:Payment>
          <pay:AUTHTOKEN>MTU5NzgzMjUyMzExOTo0ZTJhYzk5NTIxNTM3OWY5NWJiNTJjNzNmZWJkMmQwNTViMjdlYmMyNzMxMTc5Z</pay:AUTHTOKEN>
          <pay:ENTITYID>01111</pay:ENTITYID>
          <pay:PRODUCT_NO>1</pay:PRODUCT_NO>
          <pay:SOURCE_ID>KCR000000</pay:SOURCE_ID>
          <!--Optional:-->
          <pay:REFERENCE>9120000000</pay:REFERENCE>
          <pay:AMOUNT>?</pay:AMOUNT>
          <!--Optional:-->
          <pay:START_DATE>2020-08-20</pay:START_DATE>
          <!--Optional:-->
          <pay:END_DATE>2020-12-31</pay:END_DATE>
          <!--Optional:-->
          <pay:TAX_RATE>?</pay:TAX_RATE>
          <!--Optional:-->
          <pay:CUSTOMER_NAME>Carmen</pay:CUSTOMER_NAME>
          <!--Optional:-->
          <pay:ADDRESS>?</pay:ADDRESS>
          <!--Optional:-->
          <pay:TAX_ID>?</pay:TAX_ID>
          <!--Optional:-->
          <pay:EMAIL>nilton.sequeira@bancoeconomico.ao</pay:EMAIL>
          <!--Optional:-->
          <pay:PHONE_NUMBER>912000000</pay:PHONE_NUMBER>
        </pay:Payment>
      </pay:BODY>
    </pay:PaymentRefCreateRequest>
  </soapenv:Body>
</soapenv:Envelope>
